# Create a Jupyter Notebook and Create functions to connect and fire queries : Select, insert, insert many, update, delete on the database.

In [1]:
! pip install mysql_connector_python

Requirement already satisfied: mysql_connector_python in c:\users\rimi\anaconda3\lib\site-packages (8.0.32)
Requirement already satisfied: protobuf<=3.20.3,>=3.11.0 in c:\users\rimi\anaconda3\lib\site-packages (from mysql_connector_python) (3.20.3)

In [2]:
import mysql.connector

In [3]:
mydb = mysql.connector.connect(
                        host = 'localhost',
                        user = 'root',
                        password = 'root')

In [12]:
mycursor = mydb.cursor()
mycursor.execute('CREATE DATABASE demo')
mycursor.execute('show databases')
list(mycursor)

[('demo',),
 ('demo10',),
 ('demo11',),
 ('demo12',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [13]:
mydb.commit()
mydb.close()

In [14]:
mydb = mysql.connector.connect(
                        host = 'localhost',
                        user = 'root',
                        password = 'root',
                        database = 'demo11')
mycursor = mydb.cursor()

In [15]:
mycursor.execute('show tables')
for table in mycursor:
    print(table)

('department',)
('employee',)
('employee1',)
('student',)

In [36]:
Tables = ['employee', 'employee1']           # drop tables
for db in Tables:
    query = 'DROP Table {}'.format(db)
    mycursor.execute(query)
    
mycursor.execute('show tables')
for db in mycursor:
    print(db)

('department',)
('department1',)
('employee2',)
('student',)

## i.	Create a Table employee with following fields:
a.	Empid        (Primary Key)
b.	First name
Last name
c.	Age
d.	Gender
e.	Salary
f.	City
g.	Department

In [38]:
query = '''create table employee(
                emp_id int unique not null,
                first_name varchar(50),
                last_name varchar(50),
                age int ,
                gender varchar(20) not null,
                salary int not null,
                city varchar(25) ,
                department varchar(50) not null)'''

mycursor.execute(query)

In [39]:
query = '''insert into employee (emp_id, first_name, last_name, age, gender, salary, city, department)
            values(%s, %s, %s, %s, %s, %s, %s, %s)'''

val = [(101,'Sayani','Ghosh',23,'Female',30000,'Kolkata','Data Scientist'),
       (102,'Swarnab','Ghosh',26,'Male',100000,'Kolkata','Data Scientist'),
       (103,'Puja','Bose',24,'Female',60000,'Bangalore','Data Analyst'),
       (104,'Prabir','Maity',25,'Male',70000,'Haldia','Data Analyst'),
       (105,'Shibani','Patra',30,'Female',80000,'Delhi','Data Scientist')]
       
       
mycursor.executemany(query, val)

In [40]:
mycursor.execute('select * from employee')
for row in mycursor:
    print(row)

(101, 'Sayani', 'Ghosh', 23, 'Female', 30000, 'Kolkata', 'Data Scientist')
(102, 'Swarnab', 'Ghosh', 26, 'Male', 100000, 'Kolkata', 'Data Scientist')
(103, 'Puja', 'Bose', 24, 'Female', 60000, 'Bangalore', 'Data Analyst')
(104, 'Prabir', 'Maity', 25, 'Male', 70000, 'Haldia', 'Data Analyst')
(105, 'Shibani', 'Patra', 30, 'Female', 80000, 'Delhi', 'Data Scientist')

## Update Table

In [43]:
update = '''
        update employee 
        Set salary = 200000
        WHERE emp_id = 104;'''
mycursor.execute(update)

In [44]:
mycursor.execute('select * from employee')
for row in mycursor:
    print(row)

(101, 'Sayani', 'Ghosh', 23, 'Female', 30000, 'Kolkata', 'Data Scientist')
(102, 'Swarnab', 'Ghosh', 26, 'Male', 100000, 'Kolkata', 'Data Scientist')
(103, 'Puja', 'Bose', 24, 'Female', 60000, 'Bangalore', 'Data Analyst')
(104, 'Prabir', 'Maity', 25, 'Male', 200000, 'Haldia', 'Data Analyst')
(105, 'Shibani', 'Patra', 30, 'Female', 80000, 'Delhi', 'Data Scientist')

## ii.	Create a table department with following fields:
i.	Deptid
ii.	Deptname

In [23]:
query1 = '''create table department1(
                dept_id int unique not null,
                dept_name varchar(50) not null,
                location varchar(50))'''
mycursor.execute(query1)

In [24]:
mycursor.execute('show tables')
for table in mycursor:
    print(table)

('department',)
('department1',)
('employee',)
('employee1',)
('employee2',)
('student',)

In [25]:
query1 = '''insert into department1 (dept_id, dept_name, location)
            values(%s, %s, %s)'''

val = [(101, 'CSE', 'Kolkata'),
      (102, 'EE', 'Haldia'),
      (103, 'BCA', 'Bangalore'),
      (104, 'CST', 'Kolkata'),
      (105, 'Data Science', 'Bangalore')]

mycursor.executemany(query1, val)

In [26]:
mycursor.execute('select * from department1')
for row in mycursor:
    print(row)

(101, 'CSE', 'Kolkata')
(102, 'EE', 'Haldia')
(103, 'BCA', 'Bangalore')
(104, 'CST', 'Kolkata')
(105, 'Data Science', 'Bangalore')

## DELETE

In [45]:
delete = """
        delete from department1 
        where dept_id = 104; """

mycursor.execute(delete)

In [46]:
mycursor.execute('select * from department1')
for row in mycursor:
    print(row)

(101, 'CSE', 'Kolkata')
(102, 'EE', 'Haldia')
(103, 'BCA', 'Bangalore')
(105, 'Data Science', 'Bangalore')